tutorials/multiphase/multiphaseEulerFoam/laminar/damBreak4phase/0/alpha.mercury.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.mercury;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            water           { theta0 90; }
        }
        value           $internalField;
    }

    rightWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            water           { theta0 90; }
        }
        value           $internalField;
    }

    lowerWall
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
            water           { theta0 90; }
        }
        value           $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        phi             phi.mercury;
        inletValue      uniform 0;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
